# 슬라이싱, 연산
import numpy as np
# 1. 넘파이 배열 인덱싱
x = np.array( [10,20,30,40,50] )
print(x[0]) # 10
print(x[-2]) # 40
print(x[[0, 2]]) # [10 30] -> [ [특정인덱스, 특정인덱스] ]
print(x[x > 30]) # [40 50] -> 30보다 더 큰 x값만 추출

# 2. 2차원 인덱싱
x = np.array( [[1,2,3], [4,5,6], [7,8,9]])
print(x[0, 0]) # 첫 행의 첫 열 -> 1
print(x[1, 2]) # 두 번째 행의 세 번째 열 -> 6
print(x[-1, -2]) # 마지막 인덱스의 마지막(-2) 열 -> 8
print(x[x>5]) # [6 7 8 9] -> 5보다 더 큰 x값만 추출


# 3. 슬라이싱
x = np.array( [10,20,30,40,50] )
print(x[1:4]) # 1번부터 3번까지 -> [20, 30, 40]
print(x[:3]) # 시작 인덱스 생략시 0부터 시작 -> [10, 20, 30]
print(x[-3:]) # 끝 인덱스 생략시 마지막인덱스 -> [30, 40, 50]
print(x[::2]) # 2단계씩 점프하여 출력 -> [10, 30, 50]

# 4. 2차원 슬라이싱
x = np.array( [[1,2,3], [4,5,6], [7,8,9]])
# print(x[행슬라이싱, 열슬라이싱])
print(x[:,1])               # 행:전체 , 열 : 1 -> [2, 5, 8]
print(x[1,:])               # 행:1행 , 열 : 전체 -> [4, 5, 6]
print(x[0:2, 1:3])          # 0~1행 , 1~2열 -> [ [2,3], [5,6] ]

# 5.
x = np.array( [10,20,30,40,50] )
y = x[1:4] # 20, 30, 40
y[0] = 100
print(x) # y를 건드렸는데 원본에 100이 들어있다? -> 슬라이싱한 것을 수정하면 원본도 수정된다. (주소를 참조하기 때문)

y2 = x[1:4].copy() # 슬라이싱에서 파괴적이면 .copy()
y2[0] = 1000
print(x)  # 이번에는 그대로

# 6. 배열의 연산
x = np.array( [1,2,3] )
y = np.array( [4,5,6] )
print( x + y ) # 같은 위치끼리 더함(for문 필요 없음, numpy의 특징!) -> [5, 7, 9]
print( x * y) # [4, 10, 18]
print( x ** 2 ) # [1 4 9]
print( x ** y ) # [1 32 729]
print( x - 2 ) # [-1, 0, 1]
print( np.sqrt(x) ) # 제곱근/루트 -> [1. , 1.41421356 , 1.73205081]
print( x > 2 ) # x의 요소값이 2보다 큰지 true/false로 알려줌 -> [false, false, true]
print( (x > 1) & ( x < 3) ) # (조건1) & (조건2) -> [False, True, False] AND
print((x == 1) | ( x == 3)) # (조건1) | (조건2) -> [ True, False, True] OR
print( x > y) # 두 배열간의 논리(같은 위치끼리 비교 연산) -> [False False False]

# 배열간의 비교를 하거나, 연산을 할 때는 같은 위치끼리 연산을 진행함
# 스칼라(단일숫자) 와 배열 비교/연산 : T or F / 연산결과 출력